{"data":{"site":{"siteMetadata":{"title":"Royletron.dev","author":"Darren"}},"markdownRemark":{"id":"ab5cd238-2f0d-559f-9c78-124152e42015","excerpt":"Obviously the simple answer is the very thing you are looking at, but\nimportantly what do we consider a ‘web page’? Well there is quite a lot of\nhistory to that…","html":"<p>Obviously the simple answer is the very thing you are looking at, but\nimportantly what do we consider a ‘web page’? Well there is quite a lot of\nhistory to that, and I really suggest reading up on the birth of the web and all\nthe great stuff Mr Berners-Lee has given the world - in fact today marks 30\nyears since the first HTTP communication happened. So let’s jump straight\ninto…</p>\n<h2>HTML</h2>\n<p>This is the fundamental building blocks of a webpage, it is the ‘extension’ of\nthe web if you like. Like a JPG is to images HTML is to websites. At it’s core\nit contains ‘tags’ which describe the structure and content of a webpage.\nWithout HTML there is no webpage. When you load a page your browser will actually\ngo off to where you have directed it (the url e.g. <a href=\"http://www.bbc.co.uk\">http://www.bbc.co.uk</a>) and ask\nthe computer at the other end to give back HTML. Your browser then downloads\nthat HTML to your computer and ‘renders’ it by ‘parsing’ the text it finds. The\ntext in HTML is written in a ‘tags’ or ‘markup’ and these ‘tags’ represent\ndifferent things, like an <code class=\"language-text\">img</code> represents an image or a <code class=\"language-text\">h2</code> represents a\nsecond order heading (i.e. not the biggest, that would be <code class=\"language-text\">h1</code>). This is going\nto be covered in much more detail going forward. The other thing your browser\nwill do with the HTML is find ‘assets’ and these can range from files that you\nconsume, like images, vides or sound, or things that ‘enrich’ the webpage which\nare ‘CSS’ and ‘Javascript’ - which your browser also knows what to do with.</p>\n<h2>CSS</h2>\n<p>So if HTML is the structure CSS is the painting and decorating. It decides how\nthings look, that <code class=\"language-text\">img</code> is going to be this big or that <code class=\"language-text\">h2</code> is going to be this\ntype of font. CSS can do so many different things, from deciding which fonts are\nused where all the way to drawing the\n<a href=\"https://pattle.github.io/simpsons-in-css/\">Simpsons</a>. Again much more detail\nwill follow in coming posts.</p>\n<h2>Javascript</h2>","frontmatter":{"title":"Lesson 1 - What even is a webpage?","date":"March 12, 2019","description":null}}},"pageContext":{"slug":"/lesson-1/","previous":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Hello World"}},"next":null}}